---
kind: other
id: Properties.T:Autodesk.Revit.DB.ContourSetting
source: html/8762eaad-36f8-b7cb-4417-9e11781a9459.htm
---
# ContourSetting Properties

Specifies whether the .NET object represents a valid Revit entity.